### Note
* Instructions have been included for each segment. You do not have to follow them exactly, but they are included to help you think through the steps.

In [1]:
# Importing Dependencies
import pandas as pd
import csv
import matplotlib as plt
import numpy as np

In [2]:
# Loading file
purchases_file = "Resources/purchase_data.csv"
# Reading file
purchases_file_df = pd.read_csv(purchases_file)

In [3]:
# Printing dataset
purchases_file_df.head(3)

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price
0,0,Lisim78,20,Male,108,"Extraction, Quickblade Of Trembling Hands",3.53
1,1,Lisovynya38,40,Male,143,Frenzied Scimitar,1.56
2,2,Ithergue48,24,Male,92,Final Critic,4.88

In [4]:
# Selecting columns for the new dataframe
player_demographics_df=purchases_file_df.loc[:,["SN","Age","Gender"]]
# Dropping duplicates
player_demographics_df=player_demographics_df.drop_duplicates()
player_demographics_df.head(3)

            SN  Age Gender
0      Lisim78   20   Male
1  Lisovynya38   40   Male
2   Ithergue48   24   Male

## Player Count

In [5]:
# Total number of players
total_players=player_demographics_df["SN"].nunique()
print(f"There's a total of {total_players} players.")

There's a total of 576 players.

## Purchasing Analysis (Total)

* Number of Unique Items
* Average Purchase Price
* Total number of Purchases
* Total Revenue

In [6]:
# Number of Unique Items
unique_items=len(purchases_file_df["Item Name"].unique())
print(f"The Number of Unique Items is: {unique_items}.")

The Number of Unique Items is: 179.

In [7]:
# Average Purchase Price
average_purchase=round(purchases_file_df["Price"].mean(),2)
print(f"The Average Purchase Price is: ${average_purchase}")

The Average Purchase Price is: $3.05

In [8]:
# Total Number of Purchases
total_purchases=len(purchases_file_df["Purchase ID"])
print(f"The Total Number of Purchases is: {total_purchases}.")

The Total Number of Purchases is: 780.

In [9]:
# Total Revenue
total_revenue=purchases_file_df["Price"].sum()
print(f"The Total Revenue is: ${total_revenue}.")

The Total Revenue is: $2379.77.

In [10]:
# Creating Summary DataFrame
summary_df=pd.DataFrame({
    "Number of Unique Items": [unique_items],
    "Average Purchase Price": [average_purchase],
    "Total Number of Purchases": [total_purchases],
    "Total Revenue ($)": [total_revenue]
})

# Printing DataFrame
summary_df

,Number of Unique Items,Average Purchase Price,Total Number of Purchases,Total Revenue ($)
0,179,3.05,780,2379.77

## Gender Demographics

* Percentage and Count of Male Players


* Percentage and Count of Female Players


* Percentage and Count of Other / Non-Disclosed

In [11]:
# Droping duplicate users with subset for a new dataset
drop_sn_df =purchases_file_df.drop_duplicates(subset=["SN"])
# Unique users
total_sn = drop_sn_df.shape[0]
print(f"There is a total of {total_sn} users.")

There is a total of 576 users.

In [12]:
# Grouping by gender and counting totals
drop_sn_df=drop_sn_df.groupby(["Gender"]).count()
drop_sn_df

                       Purchase ID   SN  Age  Item ID  Item Name  Price
Gender
Female                          81   81   81       81         81     81
Male                           484  484  484      484        484    484
Other / Non-Disclosed           11   11   11       11         11     11

In [13]:
female = drop_sn_df.loc['Female', "SN"]
male =  drop_sn_df.loc['Male', "SN"]
other =  drop_sn_df.loc['Other / Non-Disclosed', "SN"]

In [14]:
# Female
female_perc = (female/total_sn)*100
female_perc= round(female_perc,2)

# Male
male_perc =(male/total_sn)*100
male_perc= round(male_perc,2)

# Other / Non-Disclosed
other_perc = (other/total_sn)*100
other_perc= round(other_perc,2)

In [15]:
print(f"The Percentage Count of Female Players is: {female_perc}%, with {female} female users.")
print(f"The Percentage Count of Male Players is: {male_perc}%, with {male} male users.")
print(f"The Percentage Count of Other / Non-Disclosed Players is: {other_perc}%, with {other} users.")

The Percentage Count of Female Players is: 14.06%, with 81 female users.
The Percentage Count of Male Players is: 84.03%, with 484 male users.
The Percentage Count of Other / Non-Disclosed Players is: 1.91%, with 11 users.


## Purchasing Analysis (Gender)

* Per gender:

    * Purchase Count
    * Average Purchase Price 
    * Average Purchase Total
    
    
* Summary Table

In [16]:
# Total Purchase Count by Gender
purchase_count=purchases_file_df.groupby(["Gender"]).count()["Price"].rename("Total Purchase Value")

# Total Purchase Value by Gender
purchase_value=purchases_file_df.groupby(["Gender"]).sum()["Price"].rename("Total Purchase Value")

# Average Purchase Price by Gender
avg_purchase_price=purchases_file_df.groupby(["Gender"]).mean()["Price"].rename("Average Purchase Price")

# Average Purchase Total Per User
avg_purchase_total=purchase_value/total_sn

# New DataFrame with results.
purchase_gender_df=pd.DataFrame({"Total Purchase Count": purchase_count, \
                                 "Total Purchase Value":purchase_value, \
                                 "Average Purchase Price":avg_purchase_price,\
                                 "Average Purchase Total Per Person":avg_purchase_total})

## Formatting Values
purchase_gender_df["Total Purchase Value"]=purchase_gender_df["Total Purchase Value"].map("${:,.2f}".format)
purchase_gender_df["Average Purchase Price"]=purchase_gender_df["Average Purchase Price"].map("${:,.2f}".format)
purchase_gender_df["Average Purchase Total Per Person"]=purchase_gender_df["Average Purchase Total Per Person"].map("${:,.2f}".format)

purchase_gender_df.style.set_caption("Purchasing Analysis by Gender")

# Printing DataFrame
purchase_gender_df

,Total Purchase Count,Total Purchase Value,Average Purchase Price,Average Purchase Total Per Person
Gender,,,,
Female,113,$361.94,$3.20,$0.63
Male,652,"$1,967.64",$3.02,$3.42
Other / Non-Disclosed,15,$50.19,$3.35,$0.09

## Age Demographics

* Categorizing players by age: using bings and cut

* Displaying new Summary Table

In [17]:
# Creating new Dataframe
player_demographics_df = purchases_file_df.loc[:, ["Gender", "SN", "Age"]]
player_demographics_df = player_demographics_df.drop_duplicates()
player_demographics_df.head(5)

  Gender             SN  Age
0   Male        Lisim78   20
1   Male    Lisovynya38   40
2   Male     Ithergue48   24
3   Male  Chamassasya86   24
4   Male      Iskosia90   23

In [18]:
# Establishing my bins via Max and Min Ages.

max_age=purchases_file_df["Age"].max()
min_age=purchases_file_df["Age"].min()
    
print(f"The maximum age in the dataset is {max_age}.")
print(f"The minimum age in the dataset is {min_age}.")

The maximum age in the dataset is 45.
The minimum age in the dataset is 7.

In [19]:
# Assigning users to Age Ranges (using bins)
# Bins
bins=[5,10,15,20,25,30,35,40,45]
# Labels
bin_labels=["Ages from 5-10","Ages from 10-15",\
            "Ages from 15-20","Ages from 20-25","Ages from 25-30",\
            "Ages from 30-35","Ages from 35-40","Ages from 40-45"]

player_demographics_df["Age Demographic Summary"] = pd.cut(player_demographics_df["Age"], bins, labels=bin_labels, include_lowest=True)
# Printing DataFrame
player_demographics_df.head(5)

  Gender             SN  Age Age Demographic Summary
0   Male        Lisim78   20         Ages from 15-20
1   Male    Lisovynya38   40         Ages from 35-40
2   Male     Ithergue48   24         Ages from 20-25
3   Male  Chamassasya86   24         Ages from 20-25
4   Male      Iskosia90   23         Ages from 20-25

In [20]:
# Numbers and percentages by age group
players_pergroup=player_demographics_df["Age Demographic Summary"].value_counts()
percentage=players_pergroup/total_players

# Creating DataFrame with analysis and formatting
age_demographics=pd.DataFrame({"Total Count":players_pergroup, "Percentage Of Players": percentage})
age_demographics["Percentage Of Players"]=age_demographics['Percentage Of Players'].map("{:,.2%}".format)

# Printing DataFrame
age_demographics

                 Total Count Percentage Of Players
Ages from 20-25          232                40.28%
Ages from 15-20          150                26.04%
Ages from 25-30           59                10.24%
Ages from 10-15           41                 7.12%
Ages from 30-35           37                 6.42%
Ages from 35-40           26                 4.51%
Ages from 5-10            24                 4.17%
Ages from 40-45            7                 1.22%

## Purchasing Analysis (Age)

* Binning the data by age

* Displaying a summary table with purchase count, avg. purchase price, avg. purchase total per person etc. in the table below

In [21]:
# New DataFrame to work with
perperson_df= purchases_file_df.loc[:, ["Purchase ID","SN", "Price", "Age"]]
perperson_df=perperson_df.drop_duplicates()

# Printing new Dataframe
perperson_df.head(5)

   Purchase ID             SN  Price  Age
0            0        Lisim78   3.53   20
1            1    Lisovynya38   1.56   40
2            2     Ithergue48   4.88   24
3            3  Chamassasya86   3.27   24
4            4      Iskosia90   1.44   23

In [22]:
# Binning Ages
bins=[5,10,15,20,25,30,35,40,45]

# Labeling
bin_labels=["Ages from 5-10","Ages from 10-15",\
            "Ages from 15-20","Ages from 20-25","Ages from 25-30",\
            "Ages from 30-35","Ages from 35-40","Ages from 40-45"]

perperson_df["Purchasing Analysis Per Group of Users (Age)"]=pd.cut(perperson_df["Age"], bins, labels=bin_labels, include_lowest=True)

# Printing DataFrame
perperson_df

,Purchase ID,SN,Price,Age,Purchasing Analysis Per Group of Users (Age)
0,0,Lisim78,3.53,20,Ages from 15-20
1,1,Lisovynya38,1.56,40,Ages from 35-40
2,2,Ithergue48,4.88,24,Ages from 20-25
3,3,Chamassasya86,3.27,24,Ages from 20-25
4,4,Iskosia90,1.44,23,Ages from 20-25
...,...,...,...,...,...
775,775,Aethedru70,3.54,21,Ages from 20-25
776,776,Iral74,1.63,21,Ages from 20-25
777,777,Yathecal72,3.46,20,Ages from 15-20
778,778,Sisur91,4.19,7,Ages from 5-10
779,779,Ennrian78,4.60,24,Ages from 20-25

In [23]:
# Purchase Count
pergroup_count=perperson_df.groupby(["Purchasing Analysis Per Group of Users (Age)"]).count()["Price"]
pergroup_count

Purchasing Analysis Per Group of Users (Age)
Ages from 5-10      32
Ages from 10-15     54
Ages from 15-20    200
Ages from 20-25    325
Ages from 25-30     77
Ages from 30-35     52
Ages from 35-40     33
Ages from 40-45      7
Name: Price, dtype: int64

In [24]:
# Average Purchase Price
pergroup_avg=perperson_df.groupby(["Purchasing Analysis Per Group of Users (Age)"]).mean()["Price"]
pergroup_avg

Purchasing Analysis Per Group of Users (Age)
Ages from 5-10     3.405000
Ages from 10-15    2.900000
Ages from 15-20    3.107800
Ages from 20-25    3.020431
Ages from 25-30    2.875584
Ages from 30-35    2.994423
Ages from 35-40    3.404545
Ages from 40-45    3.075714
Name: Price, dtype: float64

In [25]:
# Purchase Total Per Group
pergroup_sum=(perperson_df.groupby(["Purchasing Analysis Per Group of Users (Age)"]).sum()["Price"])
pergroup_sum

Purchasing Analysis Per Group of Users (Age)
Ages from 5-10     108.96
Ages from 10-15    156.60
Ages from 15-20    621.56
Ages from 20-25    981.64
Ages from 25-30    221.42
Ages from 30-35    155.71
Ages from 35-40    112.35
Ages from 40-45     21.53
Name: Price, dtype: float64

In [26]:
# Average Purchase Total Per Person
normalized_total = pergroup_sum / age_demographics["Total Count"]
normalized_total

Ages from 5-10     4.540000
Ages from 10-15    3.819512
Ages from 15-20    4.143733
Ages from 20-25    4.231207
Ages from 25-30    3.752881
Ages from 30-35    4.208378
Ages from 35-40    4.321154
Ages from 40-45    3.075714
dtype: float64

In [27]:
# Displaying Final DataFrame with results
final_purchase_analysis_age_df=pd.DataFrame({"Count of User Names by Age Range": pergroup_count,\
                                            "Total Purchased Per Age Group": pergroup_sum,\
                                            "Average Purchase Price by Age Range": pergroup_avg,\
                                            "Avg Total Purchase per Person":normalized_total})

# Formatting Values
final_purchase_analysis_age_df["Total Purchased Per Age Group"]=final_purchase_analysis_age_df["Total Purchased Per Age Group"].map("${:,.2f}".format)
final_purchase_analysis_age_df["Average Purchase Price by Age Range"]=final_purchase_analysis_age_df["Average Purchase Price by Age Range"].map("${:,.2f}".format)
final_purchase_analysis_age_df["Avg Total Purchase per Person"] = final_purchase_analysis_age_df["Avg Total Purchase per Person"].map("${:,.2f}".format)



# Printing DataFrame
final_purchase_analysis_age_df

,Count of User Names by Age Range,Total Purchased Per Age Group,Average Purchase Price by Age Range,Avg Total Purchase per Person
Ages from 5-10,32,$108.96,$3.40,$4.54
Ages from 10-15,54,$156.60,$2.90,$3.82
Ages from 15-20,200,$621.56,$3.11,$4.14
Ages from 20-25,325,$981.64,$3.02,$4.23
Ages from 25-30,77,$221.42,$2.88,$3.75
Ages from 30-35,52,$155.71,$2.99,$4.21
Ages from 35-40,33,$112.35,$3.40,$4.32
Ages from 40-45,7,$21.53,$3.08,$3.08

## Top Spenders

* Running calculations and displaying a summary table with results for the Top Spenders

* Sorting in descending order

In [28]:
# Identify the Top 5 Spenders in the Game by Total Purchase Value & GroupBy "SN"
top_spenders = purchases_file_df.groupby("SN")

# Calculate "Purchase Count"
spender_purchase_count = top_spenders["Purchase ID"].count()

# Calculate "Average Purchase Price"
average_spender_purchase_price = round(top_spenders["Price"].mean(),2)

# Calculate "Total Purchase Value"
total_spender_purchase_value = top_spenders["Price"].sum()

# Create Summary DataFrame
top_spenders_table = pd.DataFrame({ 
    "Purchase Count": spender_purchase_count,
    "Average Purchase Price": average_spender_purchase_price,
    "Total Purchase Value": total_spender_purchase_value
})

sort_top_spenders = top_spenders_table.sort_values(["Total Purchase Value"], ascending=False).head()
sort_top_spenders["Average Purchase Price"] = sort_top_spenders["Average Purchase Price"].astype(float).map("${:,.2f}".format)
sort_top_spenders["Total Purchase Value"] = sort_top_spenders["Total Purchase Value"].astype(float).map("${:,.2f}".format)
sort_top_spenders

             Purchase Count Average Purchase Price Total Purchase Value
SN
Lisosia93                 5                  $3.79               $18.96
Idastidru52               4                  $3.86               $15.45
Chamjask73                3                  $4.61               $13.83
Iral74                    4                  $3.40               $13.62
Iskadarya95               3                  $4.37               $13.10

## Most Popular Items

* Retrieving the Item ID, Item Name, and Item Price columns


* Performing calculations to obtain purchase count, average item price, and total purchase value


* Printing results in a DataFrame

In [29]:
# Indentifying the 5 Most Popular Items
popular_items_list = purchases_file_df[["Item ID", "Item Name", "Price"]]
popular_items = popular_items_list.groupby(["Item ID","Item Name"])

# Purchase Count
item_purchase_count = popular_items["Price"].count()

# Item Price
item_price = popular_items["Price"].sum()

# Total Purchase Value
item_purchase_value = item_price / item_purchase_count

# Printing DataFrame
most_popular_items = pd.DataFrame({
    "Purchase Count": item_purchase_count, 
    "Item Price": item_purchase_value,
    "Total Purchase Value": item_price
})

popular_items_formatted = most_popular_items.sort_values(["Purchase Count"], ascending=False).head()
popular_items_formatted["Item Price"] = popular_items_formatted["Item Price"].astype(float).map("${:,.2f}".format)
popular_items_formatted["Total Purchase Value"] = popular_items_formatted["Total Purchase Value"].astype(float).map("${:,.2f}".format)
popular_items_formatted

,,Purchase Count,Item Price,Total Purchase Value
Item ID,Item Name,,,
92,Final Critic,13,$4.61,$59.99
178,"Oathbreaker, Last Hope of the Breaking Storm",12,$4.23,$50.76
145,Fiery Glass Crusader,9,$4.58,$41.22
132,Persuasion,9,$3.22,$28.99
108,"Extraction, Quickblade Of Trembling Hands",9,$3.53,$31.77

## Most Profitable Items

* Sort the previous table and analysing prices

In [30]:
popular_items_formatted = most_popular_items.sort_values(["Total Purchase Value"], ascending=False).head()
popular_items_formatted["Item Price"] = popular_items_formatted["Item Price"].astype(float).map("${:,.2f}".format)
popular_items_formatted["Total Purchase Value"] = popular_items_formatted["Total Purchase Value"].astype(float).map("${:,.2f}".format)
popular_items_formatted

,,Purchase Count,Item Price,Total Purchase Value
Item ID,Item Name,,,
92,Final Critic,13,$4.61,$59.99
178,"Oathbreaker, Last Hope of the Breaking Storm",12,$4.23,$50.76
82,Nirvana,9,$4.90,$44.10
145,Fiery Glass Crusader,9,$4.58,$41.22
103,Singed Scalpel,8,$4.35,$34.80